#+title: Advent of Learning Code
#+author: Garid Z.
#+date: [2022-12-03 Sat 22:55]
* Advent of Learning Code
I try to learn new programming language by solving problems provided from [[https://adventofcode.com/][Advent of Code]].

* Solved Problems
|----------+-------+------+------+------|
| year     | [[https://adventofcode.com/2023][2023]]  | [[https://adventofcode.com/2022][2022]] | [[https://adventofcode.com/2021][2021]] | [[https://adventofcode.com/2020][2020]] |
|----------+-------+------+------+------|
| language | [[https://www.gnu.org/software/emacs/manual/html_node/eintr/][Elisp]] |   [[https://go.dev/][Go]] | [[https://www.rust-lang.org/][Rust]] |  [[https://nim-lang.org/][Nim]] |
|----------+-------+------+------+------|
| day-01   | [[file:AoC-2023/day01.org][1]]     |    2 |    2 |    2 |
| day-02   | [[file:AoC-2023/day02.org][2]]     |    2 |    2 |    2 |
| day-03   |       |    2 |    1 |    2 |
| day-04   |       |    2 |      |    2 |
| day-05   |       |    2 |      |    2 |
| day-06   |       |    2 |      |    2 |
| day-07   |       |    2 |      |    2 |
| day-08   |       |    2 |      |    2 |
| day-09   |       |    2 |      |    2 |
| day-10   |       |    2 |      |    2 |
| day-11   |       |    2 |      |    2 |
| day-12   |       |    2 |      |    2 |
| day-13   |       |    2 |      |    2 |
| day-14   |       |    2 |      |    2 |
| day-15   |       |    2 |      |    2 |
| day-16   |       |      |      |    2 |
| day-17   |       |    2 |      |    2 |
| day-18   |       |    2 |      |    2 |
| day-19   |       |      |      |      |
| day-20   |       |      |      |      |
| day-21   |       |    2 |      |      |
| day-22   |       |    2 |      |    2 |
| day-23   |       |    2 |      |    1 |
| day-24   |       |    2 |      |      |
| day-25   |       |    1 |      |      |
|----------+-------+------+------+------|
|          |       |   41 |    3 |   37 |
|----------+-------+------+------+------|
#+TBLFM: @>$3=vsum(@5..@-1)::@>$4=vsum(@5..@-1)::::@>$5=vsum(@5..@-1)

